Repository: mike-fabian/ibus-table
Catalog: po/*.po
Languages: ro

source: Simplified Chinese
ro: Chineză simplificată

source: Switch to “Simplified Chinese only”.
ro: Comută la „Numai chineză simplificată”.

source: Traditional Chinese
ro: Chineză tradițională

source: Switch to “Traditional Chinese only”.
ro: Comută la „Numai chineză tradițională”.

source: Simplified Chinese first
ro: Chineză simplificată mai întâi

source: Switch to “Simplified Chinese before traditional”.
ro: Comută la „Chineză simplificată înainte de tradițională”.

source: Traditional Chinese first
ro: Chineză tradițională mai întâi

source: Switch to “Traditional Chinese before simplified”.
ro: Comută la „Chineză tradițională înainte de cea simplificată”.

source: All Chinese characters
ro: Toate caracterele chinezești

source: Switch to “All Chinese characters”.
ro: Comută la „Toate caracterele chinezești”.

source: Chinese mode
ro: Modul chinezesc

source: Switch Chinese mode
ro: Comută la modul chinezesc

source: English
ro: Engleză

source: Switch to English input
ro: Comută la introducerea în limba engleză

source: Chinese
ro: Chineză

source: Switch to Chinese input
ro: Comută la introducerea în limba chineză

source: Switch to direct input
ro: Comută la introducerea directă

source: Table
ro: Tabel

source: Switch to table input
ro: Comută la introducerea din tabel

source: Input mode
ro: Modul de introducere

source: Switch Input mode
ro: Comută modul de introducere

source: Half
ro: Redusă

source: Switch to halfwidth letters
ro: Comută la litere cu lățime redusă

source: Full
ro: Completă

source: Switch to fullwidth letters
ro: Comutați la litere cu lățime completă

source: Letter width
ro: Lățimea literelor

source: Switch letter width
ro: Comută lățimea literelor

source: Switch to halfwidth punctuation
ro: Comută la semne de punctuație cu lățime redusă

source: Switch to fullwidth punctuation
ro: Comută la semne de punctuație cu lățime completă

source: Punctuation width
ro: Lățimea semnelor de punctuație

source: Switch punctuation width
ro: Comută lățimea semnelor de punctuație

source: Switch to table mode
ro: Comută la modul tabel

source: Switch to pinyin mode
ro: Comută la modul pinyin

source: Pinyin mode
ro: Modul pinyin

source: Switch pinyin mode
ro: Comută modul pinyin

source: Suggestion disabled
ro: Sugerare dezactivată

source: Switch to suggestion mode
ro: Comută la modul de sugerare

source: Suggestion enabled
ro: Sugerare activată

source: Suggestion mode
ro: Modul de sugerare

source: Switch suggestion mode
ro: Comută modul de sugerare

source: Multiple character match
ro: Potrivire de mai multe caractere

source: Switch to matching multiple characters at once
ro: Comută la potrivirea mai multor caractere simultan

source: Single character match
ro: Potrivire cu un singur caracter

source: Switch to matching only single characters
ro: Comută la potrivirea numai a caracterelor individuale

source: Onechar mode
ro: Modul de un singur caracter

source: Switch onechar mode
ro: Comută la modul de un singur caracter

source: Switch to normal commit mode (automatic commits go into the preedit instead of into the application. This enables automatic definitions of new shortcuts)
ro: Trece la modul de confirmare normal (confirmările automate sunt trimise în pre-editare în loc de aplicație. Acest lucru permite definirea automată a noilor comenzi rapide)

source: Switch to direct commit mode (automatic commits go directly into the application)
ro: Trece la modul de confirmare directă (confirmările automate sunt transmise direct în aplicație)

source: Autocommit mode
ro: Modul de confirmare automată

source: Switch autocommit mode
ro: Comută modul de confirmare automată

source: Setup
ro: Configurare

source: Configure ibus-table “%(engine-name)s”
ro: Configurează tabelul ibus „%(engine-name)s”

source: Key input
ro: Combinația de taste

source: Cancel
ro: Anulare

source: Please press a key (or a key combination)
ro: Apăsați o tastă (sau o combinație de taste)

source: The dialog will be closed when the key is released
ro: Dialogul se va închide când tasta este eliberată (ultima tastă în cazul combinației de taste)

source: Table input method for IBus.
ro: Metoda de introducere a tabelului pentru IBus.

source: translator-credits
ro: Mircea Daniel <visez.trance@gmail.com>, Remus-Gabriel Chelu <remusgabriel.chelu@disroot.org>, 2025, 2026

source: Online documentation:
ro: Documentație disponibilă în Internet:

source: Ibus Table
ro: Tabel Ibus

source: Table based input method
ro: Metoda de introducere bazată pe tabel

source: Ibus-table is an input method framework for table-based input methods. Mostly it is used for Chinese input methods such as ZhengMa, WuBi, ErBi, CangJie, …. But some tables for other languages are available as well.
ro: Tabelul Ibus este un cadru de metode de introducere pentru metode de introducere bazate pe tabele. În general, este utilizat pentru metode de introducere în limba chineză, precum ZhengMa, WuBi, ErBi, CangJie, ... Dar sunt disponibile și tabele pentru alte limbi.

source: IBus Table Preferences
ro: Preferințe tabel IBus

source: Set IBus Table Options
ro: Configurați opțiunile tabelului IBus

source: Initial state
ro: Starea inițială

source: Direct input
ro: Introducerea directă

source: Table input
ro: Introducerea din tabel

source: Preferences
ro: Preferințe

source: About
ro: Despre

source: Restore all defaults
ro: Restaurează valorile implicite

source: _Close
ro: În_chide

source: Settings
ro: Configurări

source: Details
ro: Detalii

source: Key bindings
ro: Combinații de taste

source: Menu Items
ro: Elemente din meniu

source: Remember input mode
ro: Reține modul de introducere

source: Whether the last used input mode should be remembered or whether ibus-table should start in “Table mode” by default after a restart. There are two input modes: “Table input” means the input method is on. “Direct input” is almost the same as if the input method were off, i.e. not used at all, most characters just get passed to the application. But some conversion between fullwidth and halfwidth may still happen in direct input mode.
ro: Dacă ultima modalitate de introducere utilizată trebuie memorată sau dacă tabelul ibus trebuie să pornească în mod implicit în „modul tabel” după o repornire. Există două moduri de introducere: „Introducere tabel” înseamnă că metoda de introducere este activată. „Introducere directă” este aproape la fel ca și când metoda de introducere ar fi dezactivată, adică nu este utilizată deloc, majoritatea caracterelor fiind transmise direct aplicației. Cu toate acestea, în modul de introducere directă pot avea loc unele conversii între lățimea completă și lățimea redusă.

source: No
ro: Nu

source: Yes
ro: Da

source: Chinese mode:
ro: Modul chinezesc:

source: “Simplified Chinese” shows only characters used in simplified Chinese. “Traditional Chinese” shows only characters used in traditional Chinese. “Simplified Chinese before traditional” shows all characters but puts the simplified characters higher up in the candidate list. “Traditional Chinese before simplified” puts the traditional characters higher up in the candidate list. “All characters” just shows all matches without any particular filtering on traditional versus simplified Chinese.
ro: „Chineză simplificată” afișează numai caracterele utilizate în chineza simplificată. „Chineză tradițională” afișează numai caracterele utilizate în chineza tradițională. „Chineză simplificată înainte de chineză tradițională” afișează toate caracterele, dar plasează caracterele simplificate mai sus în lista de variante. „Chineză tradițională înainte de chineză simplificată” plasează caracterele tradiționale mai sus în lista de variante. „Toate caracterele” afișează toate potrivirile fără nicio filtrare specială între chineza tradițională și chineza simplificată.

source: Simplified Chinese before traditional
ro: Chineză simplificată înainte de tradițională

source: Traditional Chinese before simplified
ro: Chineză tradițională înainte de cea simplificată

source: Table input letter width:
ro: Lățimea literelor introduse din tabel:

source: Whether to use fullwidth or halfwidth letters in table input mode.
ro: Dacă se utilizează litere cu lățime completă sau jumătate de lățime în modul de introducere din tabel.

source: Table input punctuation width:
ro: Lățimea semnelor de punctuație din tabel:

source: Whether to use fullwidth or halfwidth punctuation in table input mode.
ro: Dacă se utilizează semne de punctuație cu lățime completă sau jumătate de lățime în modul de introducere din tabel.

source: Direct input letter width:
ro: Lățimea literelor introduse direct:

source: Whether to use fullwidth or halfwidth letters in direct input mode.
ro: Dacă se utilizează litere cu lățime completă sau jumătate de lățime în modul de introducere directă.

source: Direct input punctuation width:
ro: Lățimea semnelor de punctuație introduse direct:

source: Whether to use fullwidth or halfwidth punctuation in direct input mode.
ro: Dacă se utilizează semne de punctuație cu lățime completă sau jumătate de lățime în modul de introducere directă.

source: Candidate list
ro: Listă variante

source: Show candidate list
ro: Afișează lista de variante

source: Whether candidate lists should be shown or hidden. For Chinese input methods one usually wants the candidate lists to be shown. But for some non-Chinese input methods like the Russian “translit”, hiding the candidate lists is better.
ro: Dacă listele de variante trebuie afișate sau ascunse. Pentru metodele de introducere a textului în limba chineză, de obicei se dorește afișarea listelor de variante. Însă pentru unele metode de introducere a textului în alte limbi decât chineza, cum ar fi „translit” în limba rusă, este mai bine să se ascundă listele de variante.

source: Orientation:
ro: Orientare:

source: Whether the lookup table showing the candidates should be vertical or horizontal.
ro: Dacă tabelul de căutare care afișează variantele trebuie să fie vertical sau orizontal.

source: Horizontal
ro: Orizontală

source: Vertical
ro: Verticală

source: System default
ro: Valoarea implicită a sistemului

source: Page size:
ro: Dimensiunea paginii:

source: The maximum number of candidates in one page of the lookup table. You can switch pages in the lookup table using the page up/down keys or the arrow up/down keys.
ro: Numărul maxim de variante pe o pagină din tabelul de căutare. Puteți comuta între paginile din tabelul de căutare folosind tastele pagină sus/jos sau tastele săgeată sus/jos.

source: Current key bindings:
ro: Combinațiile de taste curente:

source: Command
ro: Comandă

source: Edit
ro: _Editează

source: Edit the key bindings for the selected command
ro: Editați combinația de taste pentru comanda selectată

source: Set to default
ro: Stabilește combinația de taste ca implicită

source: Set default key bindings for the selected command
ro: Stabilește combinația de taste implicită pentru comanda selectată

source: Set all to default
ro: Stabilește toate combinațiile de taste ca implicite

source: Set default key bindings for all commands
ro: Stabilește combinațiile de taste implicite pentru toate comenzile

source: Dynamic adjust
ro: Ajustare dinamică

source: Here you can choose whether the order of the candidates is dynamically adjusted according to how often the candidates are used.
ro: Aici puteți alege dacă ordinea variantelor este ajustată dinamic în funcție de frecvența utilizării acestora.

source: Delete all learned data
ro: Șterge toate datele memorate

source: Compose:
ro: Compunere:

source: If this is set to “single char”, only single character candidates will be shown. If it is set to “Phrase” candidates consisting of several characters may be shown.
ro: Dacă această opțiune este configurată la „caracter unic” vor fi afișate numai caracterele unice. Dacă este configurată la „Frază” pot fi afișate variante compuse din mai multe caractere.

source: Phrase
ro: Frază

source: Single Char
ro: Caracter unic

source: Auto select
ro: Selectare automată

source: If set to “Yes”, this does the following 4 things: 1) When typing “Return”, commit the candidate + line-feed 2) When typing Tab, commit the candidate 3) When committing using a commit key, commit the candidate + " " 4) If typing the next character matches no candidates, commit the first candidate of the previous match. (Mostly needed for non-Chinese input methods like the Russian “translit”)
ro: Dacă este stabilită la „Da” , se efectuează următoarele 4 acțiuni: 1) Când tastați „Return”, confirmați varianta + linie nouă 2) Când tastați Tab, confirmați varianta 3) Când confirmați folosind o tastă de confirmare, confirmați varianta + „ ” 4) Dacă tastarea următorului caracter nu corespunde niciunei variante, confirmați prima variantă din potrivirea anterioară. (Necesar în special pentru metodele de introducere non-chinezești, cum ar fi „translit” rusesc)

source: Autocommit mode:
ro: Modul de confirmare automată:

source: Committing with the commit keys or with the mouse always commits to the application. This option is about “automatic” commits which may happen when one just continues typing input without committing manually. From time to time, “automatic” commits will happen then. “Direct” means such “automatic” commits go directly into the application, “Normal” means they get committed to preedit.
ro: Confirmarea cu tastele de confirmare sau cu mouse-ul confirmă întotdeauna în aplicație. Această opțiune se referă la confirmările „automate” care pot apărea atunci când se continuă introducerea datelor fără a se confirma manual. Din când în când, vor apărea confirmări „automate”. „Direct” înseamnă că astfel de confirmări „automate” intră direct în aplicație, „Normal” înseamnă că sunt confirmate în pre-editare.

source: Action when typing invalid character:
ro: Acțiune la introducerea unui caracter nevalid:

source: Determines what happens when a character which is not in the set of valid input characters for this table is typed: With “commit current candidate”, the currently selected candidate is inserted. With “commit typed keys”, the raw characters typed so far during the candidate selection process will be inserted instead. In all cases, the candidate selection ends when an invalid character is typed and the character in question is inserted immediately after the text that results from the options listed above.
ro: Determină ce se întâmplă atunci când se tastează un caracter care nu se află în setul de caractere valide pentru acest tabel: cu „confirmă varianta curentă”, se inserează varianta selectată în prezent. Cu „confirmă tastele tastate”, se vor insera în schimb caracterele brute tastate până în acel moment în timpul procesului de selecție a variantei. În toate cazurile, selecția variantei se încheie când se tastează un caracter nevalid, iar caracterul în cauză este inserat imediat după textul care rezultă din opțiunile enumerate mai sus.

source: Commit current candidate
ro: Confirmă varianta curentă

source: Commit typed keys
ro: Confirmă tastele tastate

source: Auto wildcard
ro: Caracter joker automat

source: If yes, a multi wildcard will be automatically appended to the end of the input string.
ro: Dacă da, un caracter joker multiplu va fi adăugat automat la sfârșitul șirului de intrare.

source: Single wildcard character:
ro: Caracter joker unic:

source: The wildcard to match any single character. Type RETURN or ENTER to confirm after changing the wildcard.
ro: Caracterul joker care corespunde oricărui caracter unic. Tastați RETURN sau ENTER pentru a confirma după modificarea caracterului joker.

source: Multi wildcard character:
ro: Caracter joker multiplu:

source: The wildcard used to match any number of characters. Type RETURN or ENTER to confirm after changing the wildcard.
ro: Caracterul joker eutilizat pentru a se potrivi cu orice număr de caractere. Tastați RETURN sau ENTER pentru a confirma după modificarea caracterului joker.

source: Use dark theme
ro: Utilizează tema întunecată

source: If yes, the color scheme for a dark theme will be used.
ro: Dacă da, se va utiliza schema de culori pentru o temă întunecată.

source: Play sound file on error
ro: Redă fișierul audio în caz de eroare

source: Here you can choose whether a sound file is played if an error occurs. If the simpleaudio module for Python3 is not installed, this option does nothing.
ro: Aici puteți alege dacă se redă un fișier audio în cazul apariției unei erori. Dacă modulul simpleaudio pentru Python3 nu este instalat, această opțiune nu are niciun efect.

source: Debug level:
ro: Nivel de depanare:

source: When greater than 0, debug information may be printed to the log file and debug information may also be shown graphically.
ro: Când valoarea este mai mare decât 0, informațiile de depanare pot fi imprimate în fișierul jurnal și pot fi, de asemenea, afișate grafic.

source: Are you sure?
ro: Sunteți sigur?

source: _Cancel
ro: _Anulează

source: Another instance of this app is already running.
ro: O altă instanță a acestei aplicații rulează deja.

source: Do you really want to restore all default settings?
ro: Doriți cu adevărat să restaurați toate valorile implicite?

source: Do you really want to delete all data learned from typing and selecting candidates?
ro: Doriți cu adevărat să ștergeți toate datele memorate la tastare și selectarea variantelor?

source: Select .wav sound file:
ro: Selectați fișierul audio .wav:

source: Edit key bindings for command “%s”
ro: Editați combinația de taste pentru comanda „%s”

source: Add a key binding
ro: Adaugă o combinație de taste

source: Remove selected key binding
ro: Elimină combinația de taste selectată

source: Move key binding up
ro: Mută combinația de taste în sus

source: Move key binding down
ro: Mută combinația de taste în josus

source: Do you really want to set the key bindings for all commands to their defaults?
ro: Doriți cu adevărat să restaurați combinațiile de taste implicite pentru toate comenzile la valorile implicite?

source: ibus is not running.
ro: ibus nu rulează.
